app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, I18n.t('password_resets.update.empty_password'))
---
UPDATE "users" SET "updated_at" = ?, "remember_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2024-02-07 10:55:31.212841"], ["remember_digest", nil], ["id", 762146111]]