app/controllers/relationships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
---
  def create
    Rails.logger.info 'RelationshipsControllerのcreateアクションが実行されようとしています。'
    @user = User.find(params[:followed_id])

SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
---
  def destroy
    Rails.logger.info 'RelationshipsControllerのdestroyアクションが実行されようとしています。'
    @user = Relationship.find(params[:id]).followed