app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "salt.mail0324@gmail.com"], ["LIMIT", 1]]
---
  def create
    # ユーザーをメールアドレスで検索します。入力されたメールアドレスは小文字に変換されます。
    user = User.find_by(email: params[:session][:email].downcase)