app/controllers/static_pages_controller.rb

SELECT COUNT(*) FROM `microposts` WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT `microposts`.* FROM `microposts` WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def post
    if logged_in?
      @micropost  = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])