app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM `users`

  def show
    Rails.logger.info "users_controllerのshowアクションを実行しようとしています"
    # @user = User.first
    @user = User.find(params[:id])
    # アクセスしたパラムズのURLの値をidとしてUserデータベースからアクセスする。
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 762146111], ["LIMIT", 1], ["OFFSET", 0]]

  def edit
    Rails.logger.info "users_controllerのeditアクションを実行しようとしています"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1046959424], ["LIMIT", 1]]

  def update
    Rails.logger.info "users_controllerのupdateアクションを実行しようとしています"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]

  def destroy
    Rails.logger.info "users_controllerのdestroyアクションを実行しようとしています"
    user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]

  def following
    Rails.logger.info "users_controllerのfollowingアクションを実行しようとしています"
    @title = "Following"
    @user  = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 950961012], ["LIMIT", 1]]